micropython/micropython/ports/psoc6/modules/network/network_ifx_wcm.c
STATIC void network_ap_set_config_param(cy_wcm_ap_config_t *ap_conf, qstr opt, mp_obj_t opt_value) {
    switch (opt) {
        case MP_QSTR_channel: {
            ap_conf->channel = mp_obj_get_int(opt_value);
            uint32_t ret = cy_wcm_stop_ap();
            wcm_assert_raise("network ap deactivate error (with code: %d)", ret);
            ret = cy_wcm_start_ap(ap_conf);
            wcm_assert_raise("network ap active error (with code: %d)", ret);
            break;
        }

        case MP_QSTR_hostname: {
            mp_raise_ValueError(MP_ERROR_TEXT("deprecated. use network.hostname() instead."));
            break;
        }

        default:
            mp_raise_ValueError(MP_ERROR_TEXT("unknown config param"));
    }
}

STATIC void network_sta_set_config_param(network_ifx_wcm_sta_obj_t *sta_conf, qstr opt, mp_obj_t opt_value) {
    switch (opt) {


        case MP_QSTR_channel:
        case MP_QSTR_ssid:
        case MP_QSTR_essid: {
            mp_raise_ValueError(MP_ERROR_TEXT("network access point required"));
            break;
        }

        case MP_QSTR_hostname: {
            mp_raise_ValueError(MP_ERROR_TEXT("deprecated. use network.hostname() instead."));
            break;
        }

        default:
            mp_raise_ValueError(MP_ERROR_TEXT("unknown config param"));
    }
}

STATIC mp_obj_t network_ifx_wcm_config(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (kwargs->used == 0) {
        // Get config value
        if (n_args != 2) {
            mp_raise_TypeError(MP_ERROR_TEXT("must query one param"));
        }

        if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
            cy_wcm_ap_config_t *ap_conf = wcm_get_ap_conf_ptr(network_ifx_wcm_wl_ap);
            return network_ap_get_config_param(ap_conf, mp_obj_str_get_qstr(args[1]));
        } else if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
            network_ifx_wcm_sta_obj_t *sta_conf = wcm_get_sta_conf_ptr(network_ifx_wcm_wl_sta);
            return network_sta_get_config_param(sta_conf, mp_obj_str_get_qstr(args[1]));
        }
    } else {
        // Set config value(s)
        if (n_args != 1) {
            mp_raise_TypeError(MP_ERROR_TEXT("can't specify pos and kw args"));
        }

        for (size_t i = 0; i < kwargs->alloc; ++i) {
            if (MP_MAP_SLOT_IS_FILLED(kwargs, i)) {
                mp_map_elem_t *e = &kwargs->table[i];

                if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
                    cy_wcm_ap_config_t *ap_conf = wcm_get_ap_conf_ptr(network_ifx_wcm_wl_ap);
                    network_ap_set_config_param(ap_conf, mp_obj_str_get_qstr(e->key), e->value);
                } else if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
                    network_ifx_wcm_sta_obj_t *sta_conf = wcm_get_sta_conf_ptr(network_ifx_wcm_wl_sta);
                    network_sta_set_config_param(sta_conf, mp_obj_str_get_qstr(e->key), e->value);
                }
            }
        }
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_wcm_config_obj, 1, network_ifx_wcm_config);

/*******************************************************************************/
// class bindings

STATIC const mp_rom_map_elem_t network_ifx_wcm_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_send_ethernet), MP_ROM_PTR(&network_ifx_wcm_send_ethernet_obj) },

    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&network_ifx_wcm_deinit_obj) }, // shall this be part of the module ??
    { MP_ROM_QSTR(MP_QSTR_active), MP_ROM_PTR(&network_ifx_wcm_active_obj) },
    { MP_ROM_QSTR(MP_QSTR_scan), MP_ROM_PTR(&network_ifx_wcm_scan_obj) },
    { MP_ROM_QSTR(MP_QSTR_connect), MP_ROM_PTR(&network_ifx_wcm_connect_obj) },
    { MP_ROM_QSTR(MP_QSTR_disconnect), MP_ROM_PTR(&network_ifx_wcm_disconnect_obj) },
    { MP_ROM_QSTR(MP_QSTR_isconnected), MP_ROM_PTR(&network_ifx_wcm_isconnected_obj) },
    { MP_ROM_QSTR(MP_QSTR_ifconfig), MP_ROM_PTR(&network_ifx_wcm_ifconfig_obj) },
    { MP_ROM_QSTR(MP_QSTR_status), MP_ROM_PTR(&network_ifx_wcm_status_obj) },
    { MP_ROM_QSTR(MP_QSTR_config), MP_ROM_PTR(&network_ifx_wcm_config_obj) },

    // Network WCM constants
    // Security modes
    { MP_ROM_QSTR(MP_QSTR_OPEN), MP_ROM_INT(CY_WCM_SECURITY_OPEN) },
    { MP_ROM_QSTR(MP_QSTR_WPA), MP_ROM_INT(CY_WCM_SECURITY_WPA_MIXED_PSK) },
    { MP_ROM_QSTR(MP_QSTR_WPA2), MP_ROM_INT(CY_WCM_SECURITY_WPA2_MIXED_PSK) },
    { MP_ROM_QSTR(MP_QSTR_WPA3), MP_ROM_INT(CY_WCM_SECURITY_WPA3_SAE) },
    { MP_ROM_QSTR(MP_QSTR_WPA2_WPA_PSK), MP_ROM_INT(CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK) },
};
STATIC MP_DEFINE_CONST_DICT(network_ifx_wcm_locals_dict, network_ifx_wcm_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    mp_network_ifx_wcm_type,
    MP_QSTR_IFX_WCM,
    MP_TYPE_FLAG_NONE,
    make_new, network_ifx_wcm_make_new,
    print, network_ifx_wcm_print,
    locals_dict, &network_ifx_wcm_locals_dict
    );

#endif // MICROPY_PY_NETWORK_IFX_WCM
